spec/fixtures/responses/status_success_bancontact_paid.xml

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Body>
    <extendedStatusResponse xmlns="http://www.docdatapayments.com/services/paymentservice/1_3/" ddpXsdVersion="1.3.15">
      <statusSuccess>
        <success code="SUCCESS">Operation successful.</success>
        <report>
          <approximateTotals exchangedTo="EUR" exchangeRateDate="2021-05-07 14:05:49">
            <totalRegistered>100</totalRegistered>
            <totalShopperPending>0</totalShopperPending>
            <totalAcquirerPending>0</totalAcquirerPending>
            <totalAcquirerApproved>100</totalAcquirerApproved>
            <totalCaptured>100</totalCaptured>
            <totalRefunded>0</totalRefunded>
            <totalChargedback>0</totalChargedback>
            <totalReversed>0</totalReversed>
          </approximateTotals>
          <payment>
            <id>12345678</id>
            <paymentMethod>MISTERCASH</paymentMethod>
            <authorization>
              <status>AUTHORIZED</status>
              <amount currency="EUR">100</amount>
              <confidenceLevel>ACQUIRER_APPROVED</confidenceLevel>
              <capture>
                <status>CAPTURED</status>
                <amount currency="EUR">100</amount>
                <modifiedDate>2021-05-07T14:05:44.606+02:00</modifiedDate>
              </capture>
            </authorization>
            <extended>
              <riskChecks score="0"/>
              <misterCashPaymentInfo>
                <cardHolder>Tester</cardHolder>
                <cardCountry>BE</cardCountry>
                <panLast4>3002</panLast4>
              </misterCashPaymentInfo>
            </extended>
          </payment>
          <consideredSafe>
            <value>true</value>
            <level>SAFE</level>
            <date>2021-05-07T14:05:44.760+02:00</date>
            <reason>EXACT_MATCH</reason>
          </consideredSafe>
          <apiInformation conversionApplied="false">
            <originalVersion>Order API 1.3</originalVersion>
          </apiInformation>
        </report>
      </statusSuccess>
    </extendedStatusResponse>
  </S:Body>
</S:Envelope>
